Repository: vladimir1254/Modeling-dissemination-of-information
Catalog: InformationWar/Form1.*.resx
Languages: ru

# label13.Text
source: intensity of information dissemination through rumors
ru: Интенсивность распространения информации через слухи

# label17.Text
source: intensity of forgetting information by preadepts
ru: Интенсивность забывания информации предадептами

# label21.Text
source: intensity of information forgetting by adherents
ru: Интенсивность забывания информации адептами

# label22.Text
source: The model of information dissemination in society is described by the following system of differential equations:
ru: Модель распространения информации в социуме описывается следующей системой дифференциальных уравнений:

# label23.Text
source: a - intensity of information dissemination through the media; b - intensity of information dissemination through rumors; X1 - the number of adherents in the first group; x1 - the number of pre-adepts in the first group; X2 - the number of adherents in the second group; x2 - the number of pre-adepts in the second group; y - intensity of forgetting information by adherents d - intensity of forgetting information by preadepts f1(t) - number of available individuals from the first subgroup f2(t) - number of available individuals from the second subgroup
ru: a - интенсивностью распространения информации через СМИ; b - интенсивностью распространения информации через слухи; X1 - число адептов в первой группе; x1 - число предадептов в первой группе; X2 - число адептов в второй группе; x2 - число предадептов в второй группе; y - интенсивность забывания информации адептами d - интенсивность забывания информации предадептами f1(t) - количество доступных индивидов из первой подгруппы f2(t) - количество доступных индивидов из второй подгруппы

# label24.Text
source: The computer model can be used to simplify the process of analyzing the dissemination of information in society and to determine the content characteristics, the management of which can stimulate the dissemination of information in the direction necessary for the participant (Acceleration or deceleration of the dissemination of information in society). The developed model allows you to set the parameters of social community (the number of groups 1 and 2- N1 and N2) and the characteristics of the dissemination of information flows (coefficients of the intensity of dissemination through the media and through interpersonal communication, intensity of “forgetting information" by preadepts and adepts). Based on this information , the user receives information about the dynamics of information dissemination over time, i.e. the number of "adherents" X1 and X2 "predadepts" x1 and x2 at a specific time; The main window of the program can be divided into 2 parts: Model parameters. In this part, the main parameters of the computer model are set: the number of groups 1 and 2 (N1, N2), the intensity coefficients of propagation through internal and external channels, as well as the intensity of “forgetting" information preadepts and adepts. Chart. In this area, a graphical interpretation of the result is performed. Information distribution curves are plotted on the graph.
ru: Компьютерная модель может использоваться для упрощения процесса анализа распространения информации в социуме и для определения содержательных характеристик, управление которыми может стимулировать распространение информации в нужном для участника направлении (Ускорение или замедление распространения информации в обществе). Разрабатываемая модель позволяет задавать параметры социальной общности (численность групп 1 и 2- N1 и N2) и характеристики распространения информационных потоков (коэффициенты интенсивности распространения посредством СМИ и через межличностное общение, интенсивности “забывания информации” предадептами и адептами). На основании данной информации пользователь получает информацию о динамике распространения информации по времени, т.е. количество «адептов» X1 и X2 «предадептов» x1 и x2 в конкретный момент времени; Главное окно программы можно разделить на 2 части: Параметры модели. В данной части задаются основные параметры компьютерной модели: численность групп 1 и 2 (N1, N2), коэффициенты интенсивности распространения по внутреннему и внешнему каналам, а так же интенсивности “забывания” информации предадептами и адептами. График. В данной области производится графическая интерпретация результата. На графике строятся кривые распространения информации.

# label27.Text
source: Model parameters:
ru: Параметры модели:

# label29.Text
source: The derivative of the threshold function among the members of the first subgroup who are most open to information plays a key role in the outcome of the information dissemination process. In this example, the threshold functions f1 and f2 are chosen in such a way that information is distributed across groups in such a way that for the first group this leads to a non-zero number of adherents, for the second group information is distributed only through pre-adepts.
ru: Ключевое значение для исхода процесса распространения информации играет производная пороговой функции у наиболее открытых для информации членов первой подгруппы. В данном примере, пороговые функции f1 и f2 выбраны таким образом, что информация распространяется по группам так, что для первой группы это приводит к ненулевому количеству адептов, для второй группы информация распространяется только через предадептов.

# label30.Text
source: Model parameters:
ru: Параметры модели:

# label32.Text
source: A large value of the threshold function (~ equal to the number of group members) indicates that each group member is ready become an adept, for the second group we see that almost the entire group became adepts, only a small part (Arising due to the intensity of forgetting information by adepts) remained pre-adepts. In the first group, due to the too low value of f-tion f1 - Number of people ready to become adherents, the entire group became pre-adepts due to the high intensity of information dissemination.
ru: Большое значение пороговой функции (~ равное числу участников группы), говорит о том, что каждый участник группы готов стать адептом, для второй группы видим, что почти вся группа стала адептами, лишь малая часть (Возникающая из-за интенсивности забывания информации адептами) осталась предадептами. В первой группе, из-за слишком низкого значения ф-ции f1 - Кол-во людей готовых стать адептами, вся группа стала предадептами из-за высокой интенсивности распространения информации.

# label33.Text
source: Exercise: By changing the model parameters - a, b, d, y, as well as functions f1 and f2, obtain a system in which, the number of adherents and pre-adepts in each group is not zero
ru: Упражнение: Изменяя параметры модели - a,b,d,y, а так же функции f1 и f2, получить систему в которой, количество адептов и предадептов в каждой из групп не нулевое

# label39.Text
source: intensity of information forgetting by adherents
ru: Интенсивность забывания информации адептами

# label4.Text
source: Number of people receiving information from all sources
ru: Кол-во человек получающих информацию из всех источников

# label43.Text
source: intensity of forgetting information by preadepts
ru: Интенсивность забывания информации предадептами

# label47.Text
source: intensity of information dissemination through rumors
ru: Интенсивность распространения информации через слухи

# label51.Text
source: Intensity of information dissemination through the media
ru: Интенсивность распространения информации через СМИ

# label7.Text
source: Number of people receiving information through interpersonal communication
ru: Кол-во человек получающих информацию через межличностное общение

# label8.Text
source: Intensity of information dissemination through the media
ru: Интенсивность распространения информации через СМИ

# tabPage1.Text
source: Program
ru: Программа

# tabPage2.Text
source: Description Models
ru: Описание моделей

# tabPage3.Text
source: Training
ru: Обучение

# tabPage4.Text
source: Description of the mathematical model
ru: Описание математической модели

# tabPage5.Text
source: Description of the computer model
ru: Описание компьютерной модели

# tabPage6.Text
source: Example 1
ru: Пример 1

# tabPage7.Text
source: Example 2
ru: Пример 2

# tabPage8.Text
source: Exercise
ru: Упражнение
